# 데이터 병합하기

# merge()

In [6]:
import pandas as pd

dict1 = {'name' :['홍길동', '홍길동', '김철수', '박영희', '김철수', '김철수', '홍길동'], 'korean': range(7)}
df1 = pd.DataFrame(dict1)

print( f'\n# DataFrame 출력 01 \n{'-'*40}')
df1

# DataFrame 출력 01
----------------------------------------

  name  korean
0  홍길동       0
1  홍길동       1
2  김철수       2
3  박영희       3
4  김철수       4
5  김철수       5
6  홍길동       6

In [7]:
dict2 = {'name':['김철수', '홍길동', '심수봉'], 'english':range(3)}
df2 = pd.DataFrame(dict2)

print( f'\n# DataFrame 출력 02 \n{'-'*40}')
df2

# DataFrame 출력 02
----------------------------------------

  name  english
0  김철수        0
1  홍길동        1
2  심수봉        2

In [9]:
print( f'\n# merge() 메소드의 on="name"을 이용하여 데이터 합치기 \n{'-'*60}')
pd.merge(df1, df2, on='name')

# merge() 메소드의 on="name"을 이용하여 데이터 합치기
------------------------------------------------------------

  name  korean  english
0  홍길동       0        1
1  홍길동       1        1
2  김철수       2        0
3  김철수       4        0
4  김철수       5        0
5  홍길동       6        1

In [10]:
print( f'\n# 이름순으로 정렬 \n{'-'*60}')
pd.merge(df1, df2, on='name').sort_values(by='name')

# 이름순으로 정렬
------------------------------------------------------------

  name  korean  english
2  김철수       2        0
3  김철수       4        0
4  김철수       5        0
0  홍길동       0        1
1  홍길동       1        1
5  홍길동       6        1

In [14]:
print(f'\n# how="outer" 라고 명시하면 full outer join이다. \n{'-'*50}')
pd.merge(df1, df2, how= 'outer')

# how="outer" 라고 명시하면 full outer join이다.
--------------------------------------------------

  name  korean  english
0  김철수     2.0      0.0
1  김철수     4.0      0.0
2  김철수     5.0      0.0
3  박영희     3.0      NaN
4  심수봉     NaN      2.0
5  홍길동     0.0      1.0
6  홍길동     1.0      1.0
7  홍길동     6.0      1.0

In [15]:
print( f'\n# 컬럼 이름이 동일하지 않는 경우 \n{'-'*40}')
dict3 = {'leftkey':['홍길동', '홍길동', '김철수', '박영희', '김철수', '김철수', '홍길동'], 'korean':range(7)}
df3 = pd.DataFrame(dict3)
print( '# DataFrame 출력 03')
df3

# 컬럼 이름이 동일하지 않는 경우
----------------------------------------
# DataFrame 출력 03

  leftkey  korean
0     홍길동       0
1     홍길동       1
2     김철수       2
3     박영희       3
4     김철수       4
5     김철수       5
6     홍길동       6

In [30]:
dict4 = {'rightkey': ['김철수', '홍길동', '심수봉'], 'english':range(3)}
df4 = pd.DataFrame(dict4)
print( f'\n# DataFrame 출력 04\n{'-'*30}')
df4

# DataFrame 출력 04
------------------------------

  rightkey  english
0      김철수        0
1      홍길동        1
2      심수봉        2

In [31]:
print( f'\n# merge() 메소드의 left_on과 right_on 사용하기 \n{'-'*50}')
pd.merge(df3, df4, left_on='leftkey', right_on='rightkey')

# merge() 메소드의 left_on과 right_on 사용하기
--------------------------------------------------

  leftkey  korean rightkey  english
0     홍길동       0      홍길동        1
1     홍길동       1      홍길동        1
2     김철수       2      김철수        0
3     김철수       4      김철수        0
4     김철수       5      김철수        0
5     홍길동       6      홍길동        1

In [45]:
dict1 = { 'key1':['김철수', '김철수', '박영희'],
          'key2':['one', 'two', 'one'],
          'leftval_x': [1,2,3]}
left = pd.DataFrame(dict1)
print( f'\n# DataFrame 출력 05 \n{'-'*30}')
left

# DataFrame 출력 05
------------------------------

  key1 key2  leftval_x
0  김철수  one          1
1  김철수  two          2
2  박영희  one          3

In [46]:
dict2 = {'key1':['김철수', '김철수', '박영희', '박영희'],
         'key2':['one','one','one','two'],
         'leftVal_y':[4,5,6,7]}
right = pd.DataFrame(dict2)
print( f'\n# DataFrame 출력 06 \n{'-'*30}')
right

# DataFrame 출력 06
------------------------------

  key1 key2  leftVal_y
0  김철수  one          4
1  김철수  one          5
2  박영희  one          6
3  박영희  two          7

In [47]:
# 조인할 컬럼 리스트
mylist = ['key1', 'key2']
print( f'\n# 여러 개의 컬럼 병합하기 \n{'-'*30}')
pd.merge(left, right, on=mylist, how='outer')

# 여러 개의 컬럼 병합하기
------------------------------

  key1 key2  leftval_x  leftVal_y
0  김철수  one        1.0        4.0
1  김철수  one        1.0        5.0
2  김철수  two        2.0        NaN
3  박영희  one        3.0        6.0
4  박영희  two        NaN        7.0

In [48]:
print( f'\n# suffixes 옵션 사용하기 \n{'-'*30}')
print( '# 동일한 컬럼 이름 key2에 대하여 접미사를 붙여 준다.')
pd.merge(left, right, on='key1', suffixes=('_왼쪽', '_오른쪽'))

# suffixes 옵션 사용하기
------------------------------
# 동일한 컬럼 이름 key2에 대하여 접미사를 붙여 준다.

  key1 key2_왼쪽  leftval_x key2_오른쪽  leftVal_y
0  김철수     one          1      one          4
1  김철수     one          1      one          5
2  김철수     two          2      one          4
3  김철수     two          2      one          5
4  박영희     one          3      one          6
5  박영희     one          3      two          7

In [49]:
print( f'\n# 색인을 이용한 머지 사용하기 \n{'-'*30}')
newdf1 = df1.set_index('name')
newdf1

# 색인을 이용한 머지 사용하기
------------------------------

      korean
name
홍길동        0
홍길동        1
김철수        2
박영희        3
김철수        4
김철수        5
홍길동        6

In [50]:
newdf2 = df2.set_index('name')
newdf2

      english
name
김철수         0
홍길동         1
심수봉         2

In [51]:
print( f'\n# 색인을 이용한 병합 \n{'-'*30}')
pd.merge(newdf1, newdf2, left_index=True, right_index=True, how='outer', indicator = True)

# 색인을 이용한 병합
------------------------------

      korean  english      _merge
name
김철수      2.0      0.0        both
김철수      4.0      0.0        both
김철수      5.0      0.0        both
박영희      3.0      NaN   left_only
심수봉      NaN      2.0  right_only
홍길동      0.0      1.0        both
홍길동      1.0      1.0        both
홍길동      6.0      1.0        both